content/man/man1/flatpak-remote-ls.1.org
#+TITLE: Manpages - flatpak-remote-ls.1
* NAME
flatpak-remote-ls - Show available runtimes and applications

* SYNOPSIS
*flatpak remote-ls* [OPTION...] [REMOTE]

* DESCRIPTION
Shows runtimes and applications that are available in the remote
repository with the name REMOTE, or all remotes if one isnt specified.
You can find all configured remote repositories with *flatpak remotes*.

REMOTE can be a file:// URI pointing to a local repository instead of a
remote name.

Unless overridden with the *--system*, *--user*, or *--installation*
options, this command uses either the default system-wide installation
or the per-user one, depending on which has the specified REMOTE.

* OPTIONS
The following options are understood:

*-h*, *--help*

#+begin_quote
Show help options and exit.

#+end_quote

*-u*, *--user*

#+begin_quote
Use the per-user configuration.

#+end_quote

*--system*

#+begin_quote
Use the default system-wide configuration.

#+end_quote

*--installation=NAME*

#+begin_quote
Use a system-wide installation specified by NAME among those defined in
/etc/flatpak/installations.d/. Using *--installation=default* is
equivalent to using *--system*.

#+end_quote

*--cached*

#+begin_quote
Prefer to use locally cached information if possible, even though it may
be out of date. This is faster, but risks returning stale information.

#+end_quote

*-d*, *--show-details*

#+begin_quote
Show arches, branches and commit ids, in addition to the names.
Equivalent to *--columns=all*.

#+end_quote

*--runtime*

#+begin_quote
Show only runtimes, omit applications.

#+end_quote

*--app*

#+begin_quote
Show only applications, omit runtimes.

#+end_quote

*--all*, *-a*

#+begin_quote
Show everything. By default locale and debug extensions as well as
secondary arches when the primary arch is available are hidden.

#+end_quote

*--updates*

#+begin_quote
Show only those which have updates available.

#+end_quote

*--arch=ARCH*

#+begin_quote
Show only those matching the specified architecture. By default, only
supported architectures are shown. Use *--arch=** to show all
architectures. See *flatpak --supported-arches* for architectures
supported by the host.

#+end_quote

*-v*, *--verbose*

#+begin_quote
Print debug information during command processing.

#+end_quote

*--ostree-verbose*

#+begin_quote
Print OSTree debug information during command processing.

#+end_quote

*--app-runtime=RUNTIME*

#+begin_quote
List applications that use the given runtime

#+end_quote

*--columns=FIELD,...*

#+begin_quote
Specify what information to show about each ref. You can list multiple
fields, or use this option multiple times.

Append :s[tart], :m[iddle], :e[nd] or :f[ull] to column names to change
ellipsization.

#+end_quote

* FIELDS
The following fields are understood by the *--columns* option:

name

#+begin_quote
Show the name

#+end_quote

description

#+begin_quote
Show the application description

#+end_quote

application

#+begin_quote
Show the application or runtime ID

#+end_quote

arch

#+begin_quote
Show the arch

#+end_quote

branch

#+begin_quote
Show the branch

#+end_quote

version

#+begin_quote
Show the version

#+end_quote

ref

#+begin_quote
Show the ref

#+end_quote

origin

#+begin_quote
Show the origin remote

#+end_quote

commit

#+begin_quote
Show the active commit

#+end_quote

runtime

#+begin_quote
Show the used runtime

#+end_quote

installed-size

#+begin_quote
Show the installed size

#+end_quote

download-size

#+begin_quote
Show the download size

#+end_quote

options

#+begin_quote
Show options

#+end_quote

all

#+begin_quote
Show all columns

#+end_quote

help

#+begin_quote
Show the list of available columns

#+end_quote

Note that field names can be abbreviated to a unique prefix.

* EXAMPLES
*$ flatpak --user remote-ls --app testrepo*

#+begin_quote
#+begin_example
Ref
org.gnome.Builder
org.freedesktop.glxgears
#+end_example

#+end_quote

*$ flatpak remote-ls
file:///run/media/mwleeds/d4d37026-cde2-4e5e-8bcc-d23ebbf231f9/.ostree/repo*

#+begin_quote
#+begin_example
Ref
org.kde.Khangman
#+end_example

#+end_quote

* SEE ALSO
*flatpak*(1), *flatpak-remotes*(1)
